EJERCICIOS DE PYTHON + SQL

1. Haz las importaciones necesarias para establecer la conexión y trabaar con Pandas.Establece la conexión usando mysql.connector utilizando try/except por si la conexión devielve un error.

In [11]:
!pip install mysql-connector

!pip install mysql-connector-python

Requirement already satisfied: mysql-connector in /home/admin_diana/anaconda3/lib/python3.9/site-packages (2.2.9)

Requirement already satisfied: mysql-connector-python in /home/admin_diana/anaconda3/lib/python3.9/site-packages (8.4.0)

In [3]:
import mysql.connector
from mysql.connector import errorcode

import pandas as pd
import numpy as np

In [24]:
try:
    conexion = mysql.connector.connect(
        user = 'root',
        host = '127.0.0.1', 
        password = 'AlumnaAdalab',
        database = 'alumnas_promo_h'
    )
    print("Conexión establecida correctamente.")
    
except mysql.connector.Error as error:
    print("Error al conectar a la base de datos:", error)

Conexión establecida correctamente.

2. Crea un nuevo "schema" llamado "alumnas-promo-X"

In [25]:
mycursor = conexion.cursor()
try:
    mycursor.execute("CREATE SCHEMA IF NOT EXISTS alumnas_promo_H")
    print("Schema 'alumnas_promo_H' creado correctamente.")
    
except mysql.connector.Error as error:
    print("Error al crear el schema:", error)

Schema 'alumnas_promo_H' creado correctamente.

3. Crea una tabla con la información de las alumnas de la promo. Debe incluir: id_alumna, nombre, apellidos, ciudad y teléfono.

In [7]:
try:
    mycursor.execute("CREATE TABLE alumnas (id_alumna INT AUTO_INCREMENT PRIMARY KEY, nombre VARCHAR(20), apellidos VARCHAR(50), ciudad VARCHAR(20), telefono INT(10))")
    print("Tabla 'alumnas' creada correctamente.")
    
except mysql.connector.Error as error:
    print("Error al crear la tabla:", error)

Tabla 'alumnas' creada correctamente.

4. Inserta por lo menos 10 datos en la tabla creada en el ejercicio anterior (pueden ser inventados).

In [8]:
query = "INSERT INTO alumnas (id_alumna, nombre, apellidos, ciudad, telefono) VALUES (%s, %s, %s, %s, %s)"

values = [
    (1, 'María', 'García Pérez', 'Madrid', '123456789'),
    (2, 'Ana', 'Martínez López', 'Barcelona', '987654321'),
    (3, 'Laura', 'Fernández Ruiz', 'Sevilla', '567890123'),
    (4, 'Sofía', 'Rodríguez García', 'Valencia', '456789012'),
    (5, 'Lucía', 'Gómez Sánchez', 'Bilbao', '789012345'),
    (6, 'Elena', 'Pérez Martínez', 'Málaga', '234567890'),
    (7, 'Clara', 'Sánchez Gómez', 'Zaragoza', '890123456'),
    (8, 'Marina', 'López Pérez', 'Alicante', '345678901'),
    (9, 'Paula', 'Ruiz Rodríguez', 'Murcia', '678901234'),
    (10, 'Julia', 'García Martínez', 'Granada', '901234567')
]

try:
    mycursor.executemany(query, values)
    conexion.commit()
    print("Datos insertados correctamente.")
    
except mysql.connector.Error as error:
    conexion.rollback()
    print("Error al insertar datos:", error)

mycursor.close()
conexion.close()

Datos insertados correctamente.

5. Haz una consulta que devuelva todos los registros de la tabla "alumnas" y conviértelo en Dataframe (no te olvides del nombre de las columnas).

In [31]:
try:
    mycursor.execute("SELECT * FROM alumnas")
    resultados = mycursor.fetchall()
    columnas = [i[0] for i in mycursor.description]
    
    df = pd.DataFrame(resultados, columns = columnas)

    print("Consulta realizada y DataFrame creado correctamente.")
    
except mysql.connector.Error as error:
    print("Error al realizar la consulta:", error)

Consulta realizada y DataFrame creado correctamente.

In [41]:
df.columns

Index(['id_alumna', 'nombre', 'apellidos', 'ciudad', 'telefono'], dtype='object')

In [34]:
df

   id_alumna  nombre         apellidos     ciudad   telefono
0          1   María      García Pérez     Madrid  123456789
1          2     Ana    Martínez López  Barcelona  987654321
2          3   Laura    Fernández Ruiz    Sevilla  567890123
3          4   Sofía  Rodríguez García   Valencia  456789012
4          5   Lucía     Gómez Sánchez     Bilbao  789012345
5          6   Elena    Pérez Martínez     Málaga  234567890
6          7   Clara     Sánchez Gómez   Zaragoza  890123456
7          8  Marina       López Pérez   Alicante  345678901
8          9   Paula    Ruiz Rodríguez     Murcia  678901234
9         10   Julia   García Martínez    Granada  901234567

6. Muestra los 3 primeros y tres últimos registros del Dataframe.

In [33]:
df.head(3)

   id_alumna nombre       apellidos     ciudad   telefono
0          1  María    García Pérez     Madrid  123456789
1          2    Ana  Martínez López  Barcelona  987654321
2          3  Laura  Fernández Ruiz    Sevilla  567890123

In [35]:
df.tail(3)

   id_alumna  nombre        apellidos    ciudad   telefono
7          8  Marina      López Pérez  Alicante  345678901
8          9   Paula   Ruiz Rodríguez    Murcia  678901234
9         10   Julia  García Martínez   Granada  901234567

7. ¿Hay registros duplicados?

In [36]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [39]:
df.duplicated().sum()

0

### Bonus:

8. Haz una consulta para extraer las diferentes ciudades en las que hay alumnas.

In [47]:
consulta = "SELECT DISTINCT ciudad FROM alumnas;"

mycursor.execute(consulta)

ciudades = mycursor.fetchall()

for ciudad in ciudades:
    print(ciudad[0])

Madrid
Barcelona
Sevilla
Valencia
Bilbao
Málaga
Zaragoza
Alicante
Murcia
Granada

9. Crea al menos dos Dataframes con la información de las alumnas de dos ciudades diferentes (usando dos queries).